Revit 2027 API
Glazing Properties
The Glazing type exposes the following members.
Properties
Name | Description
CommonTintColor |  The property labeled "Tint Color" from the "Glazing" schema.
CommonTintToggle |  The property labeled "Tint" from the "Glazing" schema.
GlazingColorByObject |  The property labeled "Color By Object" from the "Glazing" schema.
GlazingNoLevels |  The property labeled "Sheets of Glass" from the "Glazing" schema.
GlazingReflectance |  The property labeled "Reflectance" from the "Glazing" schema.
GlazingTransmittanceColor |  The property labeled "Color" from the "Glazing" schema.
GlazingTransmittanceMap |  The property labeled "Custom Color" from the "Glazing" schema.
Top
See Also
Reference
Glazing Class
Autodesk.Revit.DB.Visual Namespace